Autodesk.Navisworks.Api.Document.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32)
Generates an Image for this Document.

Autodesk.Navisworks.Api.Document.GenerateImage(Autodesk.Navisworks.Api.ImageGenerationStyle,System.Int32,System.Int32,System.Double)
Generates an Image for this Document.

Autodesk.Navisworks.Api.Document.PublishFile(System.String,Autodesk.Navisworks.Api.PublishProperties)
Publish contents of document to a file.
fileName: Path to try and publish file to
properties: Publishing properties to publish file with
Throws Autodesk.Navisworks.Api.DocumentFileException:
Failed to publish file
Throws System.InvalidOperationException:
Document IsClear

Autodesk.Navisworks.Api.Document.TryPublishFile(System.String,Autodesk.Navisworks.Api.PublishProperties)
Try to publish contents of document to a file.
fileName: Path to try and publish file to
properties: Publishing properties to publish file with
Returns: false if publish fails
Throws System.InvalidOperationException:
Document IsClear